
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2.1.1 神经网络 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="example2.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    说明
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../chapter1/">
            
                <a href="../../chapter1/">
            
                    
                    第一章 简介
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../../chapter1/example1.html">
            
                <a href="../../chapter1/example1.html">
            
                    
                    1.1 动机
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.2" data-path="../../chapter1/example2.html">
            
                <a href="../../chapter1/example2.html">
            
                    
                    1.2 目标
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2.3" data-path="../../chapter1/example3.html">
            
                <a href="../../chapter1/example3.html">
            
                    
                    1.3 大纲
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../">
            
                <a href="../">
            
                    
                    第二章 多层神经网络
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="./">
            
                <a href="./">
            
                    
                    2.1 多层结构
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1.1" data-path="example1.html">
            
                <a href="example1.html">
            
                    
                    2.1.1 神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="example2.html">
            
                <a href="example2.html">
            
                    
                    2.1.2 循环神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="example3.html">
            
                <a href="example3.html">
            
                    
                    2.1.3 卷积神经网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="example4.html">
            
                <a href="example4.html">
            
                    
                    2.1.4 生成对抗网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="example5.html">
            
                <a href="example5.html">
            
                    
                    2.1.5 多层神经网络的训练
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="example6.html">
            
                <a href="example6.html">
            
                    
                    2.1.6 一句话描述迁移学习
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../example2/">
            
                <a href="../example2/">
            
                    
                    2.2 空间卷积神经网络
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.2.1" data-path="../example2/example1.html">
            
                <a href="../example2/example1.html">
            
                    
                    2.2.1 目前的卷积神经网络的一些主流架构
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2.2" data-path="../example2/example2.html">
            
                <a href="../example2/example2.html">
            
                    
                    2.2.2 卷积神经网络的不变性
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2.1.1 神经网络</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="211-&#x795E;&#x7ECF;&#x7F51;&#x7EDC;">2.1.1 &#x795E;&#x7ECF;&#x7F51;&#x7EDC;</h1>
<p>&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7ED3;&#x6784;&#x4E00;&#x822C;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x5C42;x&#xFF0C;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5C42;y&#xFF0C;&#x53CA;&#x4E00;&#x7CFB;&#x5217;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x9690;&#x85CF;&#x5C42;h&#xFF0C;&#x5982;&#x56FE;2.1&#x6240;&#x793A;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BCF;&#x4E00;&#x5C42;&#x9690;&#x85CF;&#x5C42;&#x4F1A;&#x63A5;&#x6536;&#x524D;&#x4E00;&#x5C42;&#x795E;&#x7ECF;&#x5143;&#x7684;&#x6240;&#x6709;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x5BF9;&#x8F93;&#x5165;&#x8FDB;&#x884C;&#x52A0;&#x6743;&#x6C42;&#x548C;&#xFF0C;&#x4E4B;&#x540E;&#x5728;&#x5BF9;&#x8F93;&#x5165;&#x7684;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x975E;&#x7EBF;&#x6027;&#x53D8;&#x6362;&#xFF1A;</p>
<p>$$
h<em>{j}=F\left ( b</em>{j}+\sum<em>{i} w</em>{ij}x_{i}\right)\tag {2.1}</p>
<p>$$</p>
<p>&#x5176;&#x4E2D;$$w_{ij}$$&#x662F;&#x63A7;&#x5236;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x5355;&#x5143;&#x4E4B;&#x95F4;&#x7684;&#x8FDE;&#x63A5;&#x5F3A;&#x5EA6;&#x7684;&#x6743;&#x91CD;&#xFF0C;b_j&#x662F;&#x9690;&#x85CF;&#x5355;&#x5143;&#x7684;&#x589E;&#x76CA;&#xFF0C;&#x800C;F(.)&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x7EBF;&#x6027;&#x51FD;&#x6570;&#xFF0C;&#x5982;sigmoid&#x51FD;&#x6570;&#x3002;</p>
<p><img src="../../.gitbook/assets/1536889663-1.png" alt="&#x56FE;2.1 &#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x67B6;&#x6784;"></p>
<p>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x88AB;&#x770B;&#x4E3A;&#x662F;Rosenblatt&#x611F;&#x77E5;&#x673A;&#x6216;&#x591A;&#x5C42;&#x611F;&#x77E5;&#x673A;&#x7684;&#x73B0;&#x4EE3;&#x5316;&#x6848;&#x4F8B;&#x3002;&#x867D;&#x7136;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x51FA;&#x73B0;&#x5F88;&#x591A;&#x5E74;&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x76F4;&#x5230;&#x6700;&#x8FD1;&#x5B83;&#x624D;&#x88AB;&#x91CD;&#x89C6;&#x8D77;&#x6765;&#x3002;&#x5BFC;&#x81F4;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x77E5;&#x9053;&#x73B0;&#x5728;&#x624D;&#x88AB;&#x91CD;&#x89C6;&#x7684;&#x539F;&#x56E0;&#x4E3B;&#x8981;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x70B9;&#xFF0C;1&#x3001;&#x5355;&#x5C42;&#x611F;&#x77E5;&#x673A;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5982;&#x5F02;&#x6216;&#x64CD;&#x4F5C;&#xFF08;XOR&#xFF09;&#xFF0C;&#x76F4;&#x5230;&#x63D0;&#x51FA;&#x591A;&#x5C42;&#x611F;&#x77E5;&#x673A;&#x8FD9;&#x4E00;&#x95EE;&#x9898;&#x624D;&#x88AB;&#x89E3;&#x51B3;&#xFF1B;2&#x3001;&#x5728;&#x8BEF;&#x5DEE;&#x53CD;&#x5411;&#x4F20;&#x9012;&#x7B97;&#x6CD5;&#x63D0;&#x51FA;&#x524D;&#xFF0C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6CA1;&#x6709;&#x4E00;&#x5957;&#x5408;&#x9002;&#x7684;&#x8BAD;&#x7EC3;&#x65B9;&#x6CD5;&#xFF1B;&#x7136;&#x800C;&#x591A;&#x5C42;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x53E6;&#x4E00;&#x4E2A;&#x5F88;&#x5927;&#x7684;&#x95EE;&#x9898;&#x662F;&#x5B83;&#x6709;&#x5F88;&#x591A;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x4E86;&#x9700;&#x8981;&#x5F88;&#x591A;&#x7684;&#x6570;&#x636E;&#x53CA;&#x5F88;&#x5927;&#x7684;&#x8FD0;&#x7B97;&#x8D44;&#x6E90;&#x6765;&#x5BF9;&#x5BF9;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x8BAD;&#x7EC3;&#x3002; &#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x4E00;&#x6B21;&#x91CD;&#x5927;&#x7684;&#x98DE;&#x8DC3;&#x662F;&#x57FA;&#x4E8E;&#x53D7;&#x9650;&#x5236;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#xFF08;RBM&#xFF09;&#x7684;&#x9010;&#x5C42;&#x65E0;&#x76D1;&#x7763;&#x9884;&#x8BAD;&#x7EC3;&#x3002;&#x53D7;&#x9650;&#x5236;&#x73BB;&#x5C14;&#x5179;&#x66FC;&#x673A;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x662F;&#x4E00;&#x4E2A;&#x4E24;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x51FA;&#x4E8E;&#x53D7;&#x9650;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5B83;&#x4EC5;&#x6709;&#x524D;&#x9988;&#x8FDE;&#x63A5;&#x3002;&#x5728;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x4E2D;&#xFF0C;&#x57FA;&#x4E8E;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x8BAD;&#x7EC3;RBM&#x7684;&#x7B56;&#x7565;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;3&#x6B65;&#xFF1A;1&#x3001;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;&#xFF0C;&#x4ECE;&#x968F;&#x673A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x6743;&#x91CD;$$w<em>{ij}$$&#x53CA;&#x504F;&#x7F6E;$$b</em>{j}$$,&#x6BCF;&#x4E2A;&#x9690;&#x85CF;&#x5C42;&#x5355;&#x5143;$$h<em>{j}$$&#x90FD;&#x662F;&#x6982;&#x7387;0-1&#x4E4B;&#x95F4;&#x7684;&#x503C;$$p</em>{j}$$&#x3002;&#x6982;&#x7387;$$p_{j}$$&#x53EF;&#x4EE5;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#xFF1A;</p>
<p>$$
p<em>{j}=\sigma\left( b</em>{j}+\sum<em>{i}x</em>{i}w_{ij}\right)\tag {2.2}</p>
<p>$$</p>
<p>&#x5176;&#x4E2D;&#xFF0C;$$\sigma\left(y\right)=1/\left(1+exp\left(-y\right)\right)$$&#x3002;2&#x3001;&#x4E00;&#x65E6;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x72B6;&#x6001;&#x7531;&#x516C;&#x5F0F;$$2.2$$&#x5F97;&#x5230;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x9690;&#x85CF;&#x5C42;&#x72B6;&#x6001;&#x53CA;&#x516C;&#x5F0F;$$p<em>{i}=\sigma\left(b</em>{i}+\sum<em>{j}h</em>{j}w<em>{ij}\right)$$&#x6309;&#x6982;&#x7387;&#x5BF9;&#x6BCF;&#x4E2A;&#x50CF;&#x7D20;$$x</em>{i}$$&#x5BF9;&#x56FE;&#x50CF;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x3002;3&#x3001;&#x6743;&#x91CD;&#x5C06;&#x6839;&#x636E;&#x8F93;&#x5165;&#x5C42;&#x53CA;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x91CD;&#x6784;&#x8BEF;&#x5DEE;&#x6765;&#x8FDB;&#x884C;&#x66F4;&#x65B0;&#xFF0C;&#x66F4;&#x65B0;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$$
\Delta w<em>{ij}=\alpha \left(\langle x</em>{i}h<em>{j}\rangle</em>{input}-\langle x<em>{i}h</em>{j}\rangle_reconstruction\right)\tag {2.3}</p>
<p>$$</p>
<p>&#x5176;&#x4E2D;$$\alpha$$&#x4E3A;&#x5B66;&#x4E60;&#x901F;&#x7387;&#xFF0C;$$\langle x<em>{i}h</em>{j}\rangle$$&#x662F;&#x50CF;&#x7D20;$$x<em>{i}$$&#x53CA;&#x9690;&#x85CF;&#x5355;&#x5143;$$h</em>{j}$$&#x7684;&#x6570;&#x91CF;&#x4E4B;&#x548C;&#x3002;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x5FAA;&#x73AF;$$N$$&#x6B21;&#xFF0C;&#x6216;&#x8005;&#x77E5;&#x9053;&#x91CD;&#x6784;&#x8BEF;&#x5DEE;&#x5C0F;&#x4E8E;&#x9884;&#x5148;&#x8BBE;&#x5B9A;&#x7684;&#x9608;&#x503C;threshold&#xFF0C;$$\tau$$&#x3002;&#x4E00;&#x65E6;&#x4E00;&#x5C42;&#x8BAD;&#x7EC3;&#x7ED3;&#x675F;&#xFF0C;&#x5219;&#x8BE5;&#x5C42;&#x7684;&#x8F93;&#x51FA;&#x5219;&#x4F5C;&#x4E3A;&#x4E0B;&#x4E00;&#x5C42;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x540C;&#x6837;&#x7684;&#x4F18;&#x5316;&#x7B56;&#x7565;&#x6765;&#x8BAD;&#x7EC3;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x5C42;&#x3002;&#x901A;&#x5E38;&#xFF0C;&#x5F53;&#x6240;&#x6709;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C42;&#x90FD;&#x7ECF;&#x8FC7;&#x9884;&#x8BAD;&#x7EC3;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x4F7F;&#x7528;&#x5E26;&#x6807;&#x7B7E;&#x7684;&#x6570;&#x636E;&#x901A;&#x8FC7;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x6CD5;&#x6765;&#x8FDB;&#x4E00;&#x6B65;&#x5FAE;&#x8C03;&#x7F51;&#x7EDC;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x9010;&#x5C42;&#x9884;&#x8BAD;&#x7EC3;&#x7684;&#x7B56;&#x7565;&#x4F7F;&#x5F97;&#x5BF9;&#x6240;&#x9700;&#x7684;&#x5E26;&#x6807;&#x7B7E;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x7684;&#x6570;&#x636E;&#x91CF;&#x5927;&#x91CF;&#x51CF;&#x5C11;&#xFF0C;&#x56E0;&#x4E3A;&#x57FA;&#x4E8E;&#x65E0;&#x76D1;&#x7763;&#x9884;&#x8BAD;&#x7EC3;&#x7684;RBM&#x80FD;&#x4E3A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x63D0;&#x4F9B;&#x4E00;&#x5957;&#x6709;&#x7528;&#x7684;&#x521D;&#x59CB;&#x5316;&#x53C2;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x7B80;&#x5316;&#x4E86;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8BAD;&#x7EC3;&#x96BE;&#x5EA6;&#x3002; &#x57FA;&#x4E8E;&#x5806;&#x53E0;RBM&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6700;&#x5148;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x964D;&#x7EF4;&#x5668;&#x5728;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x4E2D;&#x6210;&#x529F;&#x5E94;&#x7528;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x88AB;&#x5F53;&#x505A;&#x4E00;&#x79CD;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x3002;&#x653E;&#x5BBD;&#x677E;&#x70B9;&#x5C06;&#xFF0C;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x53EF;&#x4EE5;&#x88AB;&#x5B9A;&#x4E49;&#x6210;&#x5177;&#x6709;&#x4E24;&#x90E8;&#x5206;&#x9010;&#x5C42;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#x662F;&#x7F16;&#x7801;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x6765;&#x5C06;&#x8F93;&#x5165;&#x6570;&#x636E;&#x8F6C;&#x5316;&#x4E3A;&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF1B;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x662F;&#x89E3;&#x7801;&#x5668;&#x90E8;&#x5206;&#xFF0C;&#x7528;&#x6765;&#x5C06;&#x7279;&#x5F81;&#x5411;&#x91CF;&#x6620;&#x5C04;&#x56DE;&#x53BB;&#xFF0C;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x7684;&#x793A;&#x610F;&#x56FE;&#x5982;&#x56FE;2.2&#x6240;&#x793A;&#x3002;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x7684;&#x53C2;&#x6570;&#x901A;&#x8FC7;&#x8F93;&#x5165;&#x548C;&#x91CD;&#x6784;&#x7684;&#x7ED3;&#x679C;&#x4E4B;&#x95F4;&#x7684;&#x91CD;&#x6784;&#x8BEF;&#x5DEE;&#x6765;&#x5B66;&#x4E60;&#x5F97;&#x5230;&#x3002;</p>
<p><img src="../../.gitbook/assets/1537231100-1.png" alt="&#x56FE;2.2 &#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x7ED3;&#x6784;"></p>
<p>&#x5728;RBM&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x4E4B;&#x540E;&#xFF0C;&#x53C8;&#x6709;&#x51E0;&#x79CD;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x88AB;&#x63D0;&#x51FA;&#x3002;&#x6BCF;&#x79CD;&#x7F16;&#x7801;&#x5668;&#x90FD;&#x52A0;&#x5165;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x6B63;&#x5219;&#x5316;&#x6765;&#x9632;&#x6B62;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5B66;&#x4E60;&#x65E0;&#x5173;&#x7684;&#x7279;&#x5F81;&#x800C;&#x80FD;&#x5B66;&#x4E60;&#x5230;&#x5E94;&#x5BF9;&#x4E0D;&#x540C;&#x6837;&#x672C;&#x7684;&#x4E0D;&#x53D8;&#x6027;&#x7279;&#x5F81;&#x3002;&#x5178;&#x578B;&#x7684;&#x81EA;&#x52A8;&#x7F16;&#x7801;&#x5668;&#x5305;&#x62EC;&#x7A00;&#x758F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;SAE&#xFF09;&#x3001;&#x964D;&#x566A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;DAE&#xFF09;&#x4EE5;&#x53CA;&#x6536;&#x7F29;&#x81EA;&#x7F16;&#x7801;&#x5668;&#xFF08;CAE&#xFF09;&#x3002;&#x7A00;&#x758F;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x5141;&#x8BB8;&#x4E2D;&#x95F4;&#x7684;&#x8868;&#x793A;&#x5C42;&#xFF08;&#x4F8B;&#x5982;&#x7531;&#x7F16;&#x7801;&#x5668;&#x8F93;&#x51FA;&#x7684;&#x90E8;&#x5206;&#xFF09;&#x7684;&#x7EF4;&#x5EA6;&#x5927;&#x4E8E;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x7EF4;&#x5EA6;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x60E9;&#x7F5A;&#x9879;&#x6765;&#x5F3A;&#x5236;&#x4F7F;&#x8F93;&#x51FA;&#x5177;&#x6709;&#x7A00;&#x758F;&#x6027;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x964D;&#x566A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x901A;&#x8FC7;&#x5229;&#x7528;&#x4E00;&#x4E2A;&#x4EBA;&#x4E3A;&#x6539;&#x53D8;&#x540E;&#x7684;&#x8F93;&#x5165;&#x6765;&#x91CD;&#x6784;&#x4E00;&#x4E2A;&#x6D01;&#x51C0;&#x7684;&#x8F93;&#x5165;&#x6765;&#x4F7F;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x7279;&#x5F81;&#x66F4;&#x5177;&#x6709;&#x9C81;&#x68D2;&#x6027;&#x3002;&#x76F8;&#x4F3C;&#x7684;&#xFF0C;&#x6536;&#x7F29;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x662F;&#x5728;&#x964D;&#x566A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x60E9;&#x7F5A;&#x5BF9;&#x566A;&#x58F0;&#x66F4;&#x654F;&#x611F;&#x7684;&#x5355;&#x5143;&#x3002;&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x4E0D;&#x540C;&#x964D;&#x566A;&#x81EA;&#x7F16;&#x7801;&#x5668;&#x53EF;&#x4EE5;&#x67E5;&#x770B;&#x53C2;&#x8003;[7]&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: 2.1 多层结构">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="example2.html" class="navigation navigation-next " aria-label="Next page: 2.1.2 循环神经网络">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2.1.1 神经网络","level":"1.3.1.1","depth":3,"next":{"title":"2.1.2 循环神经网络","level":"1.3.1.2","depth":3,"path":"chapter2/example1/example2.md","ref":"chapter2/example1/example2.md","articles":[]},"previous":{"title":"2.1 多层结构","level":"1.3.1","depth":2,"path":"chapter2/example1/README.md","ref":"chapter2/example1/README.md","articles":[{"title":"2.1.1 神经网络","level":"1.3.1.1","depth":3,"path":"chapter2/example1/example1.md","ref":"chapter2/example1/example1.md","articles":[]},{"title":"2.1.2 循环神经网络","level":"1.3.1.2","depth":3,"path":"chapter2/example1/example2.md","ref":"chapter2/example1/example2.md","articles":[]},{"title":"2.1.3 卷积神经网络","level":"1.3.1.3","depth":3,"path":"chapter2/example1/example3.md","ref":"chapter2/example1/example3.md","articles":[]},{"title":"2.1.4 生成对抗网络","level":"1.3.1.4","depth":3,"path":"chapter2/example1/example4.md","ref":"chapter2/example1/example4.md","articles":[]},{"title":"2.1.5 多层神经网络的训练","level":"1.3.1.5","depth":3,"path":"chapter2/example1/example5.md","ref":"chapter2/example1/example5.md","articles":[]},{"title":"2.1.6 一句话描述迁移学习","level":"1.3.1.6","depth":3,"path":"chapter2/example1/example6.md","ref":"chapter2/example1/example6.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"chapter2/example1/example1.md","mtime":"2018-09-25T07:29:05.416Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-09-26T03:09:42.914Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

